Revit 2024 API
ParameterTypeId.RbsElecPanelMainstypeParam Property
 "Mains Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsElecPanelMainstypeParam { get; }
Visual Basic
Public Shared ReadOnly Property RbsElecPanelMainstypeParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsElecPanelMainstypeParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace